# Guid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GuidEnum..::..Guid Property
GuidEnum Class See Also
---
The Guid of GUID-based enum object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Guid Guid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Guid As Guid
	Get
```

Visual C++
---
```text
public:
property Guid Guid {
	Guid get ();
}
```

# See Also
GuidEnum Class
Autodesk.Revit.DB Namespace